nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/driver_examples/powerquad/benchmark_vector/powerquad_benchmark_vector.c
    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

static void PQ_VectorLnF32Test(void)
{
    float32_t input[32]  = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6,
                           1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    float32_t result[32] = {0};
    float32_t lnRef[32]  = {0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760,
                           0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760,
                           0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760,
                           0, 0.693147, 1.098612, 1.386294, 1.609438, 1.791760, 1.609438, 1.791760};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorLnF32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(lnRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorLnQ31Test(void)
{
    q31_t input[32]  = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    q31_t result[32] = {0};
    q31_t lnRef[32]  = {0, 1, 1, 1, 2, 2, 2, 2, 0, 1, 1, 1, 2, 2, 2, 2, 0, 1, 1, 1, 2, 2, 2, 2, 0, 1, 1, 1, 2, 2, 2, 2};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorLnFixed32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(lnRef[i] == result[i]);
    }
}

static void PQ_VectorInvF32Test(void)
{
    float32_t input[32]  = {1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20,
                           1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20};
    float32_t result[32] = {0};
    float32_t invRef[32] = {1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05, 1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05,
                            1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05, 1, 0.5, 0.25, 0.2, 0.1, 0.05, 0.1, 0.05};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorInvF32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(invRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorInvQ31Test(void)
{
    q31_t input[32] = {
        1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20, 1, 2, 4, 5, 10, 20, 10, 20,
    };
    q31_t result[32] = {0};
    q31_t invRef[32] = {1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorInvFixed32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(invRef[i] == result[i]);
    }
}

/* Float Vector Sqrt */
static void PQ_VectorSqrtF32Test(void)
{
    float32_t input[32]   = {0.04, 0.25, 1, 4, 9, 16, 144, 1.69, 0.04, 0.25, 1, 4, 9, 16, 144, 1.69,
                           0.04, 0.25, 1, 4, 9, 16, 144, 1.69, 0.04, 0.25, 1, 4, 9, 16, 144, 1.69};
    float32_t result[32]  = {0};
    float32_t sqrtRef[32] = {0.2, 0.5, 1, 2, 3, 4, 12, 1.3, 0.2, 0.5, 1, 2, 3, 4, 12, 1.3,
                             0.2, 0.5, 1, 2, 3, 4, 12, 1.3, 0.2, 0.5, 1, 2, 3, 4, 12, 1.3};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorSqrtF32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(sqrtRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorSqrtQ31Test(void)
{
    q31_t input[32]   = {0, 1, 1, 4, 144, 169, 144, 169, 0, 1, 1, 4, 144, 169, 144, 169,
                       0, 1, 1, 4, 144, 169, 144, 169, 0, 1, 1, 4, 144, 169, 144, 169};
    q31_t result[32]  = {0};
    q31_t sqrtRef[32] = {0, 1, 1, 2, 12, 13, 12, 13, 0, 1, 1, 2, 12, 13, 12, 13,
                         0, 1, 1, 2, 12, 13, 12, 13, 0, 1, 1, 2, 12, 13, 12, 13};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorSqrtFixed32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(sqrtRef[i] == result[i]);
    }
}

static void PQ_VectorInvSqrtF32Test(void)
{
    float32_t input[32]      = {4, 1, 1, 0.25, 16, 100, 16, 100, 4, 1, 1, 0.25, 16, 100, 16, 100,
                           4, 1, 1, 0.25, 16, 100, 16, 100, 4, 1, 1, 0.25, 16, 100, 16, 100};
    float32_t result[32]     = {0};
    float32_t invSqrtRef[32] = {0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1, 0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1,
                                0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1, 0.5, 1, 1, 2, 0.25, 0.1, 0.25, 0.1};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorInvSqrtF32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(invSqrtRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorInvSqrtQ31Test(void)
{
    q31_t input[32]      = {2, 1, 1, 4, 1, 100, 1, 100, 2, 1, 1, 4, 1, 100, 1, 100,
                       2, 1, 1, 4, 1, 100, 1, 100, 2, 1, 1, 4, 1, 100, 1, 100};
    q31_t result[32]     = {0};
    q31_t invSqrtRef[32] = {1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0,
                            1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorInvSqrtFixed32(input, result, 8);
    }

