nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/driver_examples/powerquad/benchmark_vector/powerquad_benchmark_vector.c
    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(invSqrtRef[i] == result[i]);
    }
}

static void PQ_VectorEtoxF32Test(void)
{
    float32_t input[32]   = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6,
                           1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    float32_t result[32]  = {0};
    float32_t etoxRef[32] = {2.718282, 7.389056, 20.085537, 54.598148, 148.413162, 403.428802, 148.413162, 403.428802,
                             2.718282, 7.389056, 20.085537, 54.598148, 148.413162, 403.428802, 148.413162, 403.428802,
                             2.718282, 7.389056, 20.085537, 54.598148, 148.413162, 403.428802, 148.413162, 403.428802,
                             2.718282, 7.389056, 20.085537, 54.598148, 148.413162, 403.428802, 148.413162, 403.428802};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorEtoxF32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(etoxRef[i] - result[i]) < 0.001);
    }
}

static void PQ_VectorEtoxQ31Test(void)
{
    q31_t input[32]  = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    q31_t result[32] = {0};
    q31_t etoxRef[32] = {3, 7, 20, 55, 148, 403, 148, 403, 3, 7, 20, 55, 148, 403, 148, 403,
                         3, 7, 20, 55, 148, 403, 148, 403, 3, 7, 20, 55, 148, 403, 148, 403};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorEtoxFixed32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(etoxRef[i] == result[i]);
    }
}

static void PQ_VectorEtonxF32Test(void)
{
    float32_t input[32]    = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6,
                           1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    float32_t result[32]   = {0};
    float32_t etonxRef[32] = {0.367879, 0.135335, 0.049787, 0.018316, 0.006738, 0.002479, 0.006738, 0.002479,
                              0.367879, 0.135335, 0.049787, 0.018316, 0.006738, 0.002479, 0.006738, 0.002479,
                              0.367879, 0.135335, 0.049787, 0.018316, 0.006738, 0.002479, 0.006738, 0.002479,
                              0.367879, 0.135335, 0.049787, 0.018316, 0.006738, 0.002479, 0.006738, 0.002479};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorEtonxF32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(etonxRef[i] - result[i]) < 0.00001);
    }
}

static void PQ_VectorEtonxQ31Test(void)
{
    q31_t input[32]  = {1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6, 1, 2, 3, 4, 5, 6, 5, 6};
    q31_t result[32] = {0};
    q31_t etonxRef[32] = {0};

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < VECTOR_TEST_LOOP; i++)
    {
        PQ_VectorEtonxFixed32(input, result, 8);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (int i = 0; i < 8; i++)
    {
        EXAMPLE_ASSERT_TRUE(etonxRef[i] == result[i]);
    }
}

static void PQ_BiquadCascadedf2F32Test(void)
{
    uint8_t stage               = 3;
    float32_t dataForBiquad[16] = {1024.0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    float32_t biquadResult[16]  = {0};
    float32_t biquadRef[16]     = {16.270306,  -45.510643, 63.659611, -35.223492, -20.120678, 45.005569,
                               -14.585688, -26.120077, 25.420242, 6.363828,   -21.309111, 4.942792,
                               12.659100,  -8.400287,  -5.238772, 7.446815};

    pq_biquad_cascade_df2_instance instance;

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < BIQUAD_TEST_LOOP; i++)
    {
        q31_t state[24] = {0, 0, 0x3e80b780, 0x3f00b780, 0x3e80b780, 0xbe2f4f0e, 0x3e350b0f, 0,
                           0, 0, 0x3e80b780, 0x3f00b780, 0x3e80b780, 0xbe2f4f0e, 0x3e350b0f, 0,
                           0, 0, 0x3e80b780, 0x3f00b780, 0x3e80b780, 0xbe2f4f0e, 0x3e350b0f, 0};
        PQ_BiquadCascadeDf2Init(&instance, stage, (pq_biquad_state_t *)state);
        PQ_BiquadCascadeDf2F32(&instance, dataForBiquad, biquadResult, 16);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(fabs(biquadRef[i] - biquadResult[i]) < 0.00001);
    }
}

static void PQ_BiquadCascadedf2Q31Test(void)
{
    uint8_t stage           = 3;
    q31_t dataForBiquad[16] = {1024, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
    q31_t biquadResult[16]  = {0};
    q31_t biquadRef[16]     = {16, -46, 64, -35, -20, 45, -15, -26, 25, 6, -21, 5, 13, -8, -5, 7};

    pq_biquad_cascade_df2_instance instance;

    uint32_t oldTime = TEST_GetTime();
    for (uint32_t i = 0; i < BIQUAD_TEST_LOOP; i++)
    {
        q31_t state[24] = {0, 0, 0x3e80b780, 0x3f00b780, 0x3e80b780, 0xbe2f4f0e, 0x3e350b0f, 0,
                           0, 0, 0x3e80b780, 0x3f00b780, 0x3e80b780, 0xbe2f4f0e, 0x3e350b0f, 0,
                           0, 0, 0x3e80b780, 0x3f00b780, 0x3e80b780, 0xbe2f4f0e, 0x3e350b0f, 0};
        PQ_BiquadCascadeDf2Init(&instance, stage, (pq_biquad_state_t *)state);
        PQ_BiquadCascadeDf2Fixed32(&instance, dataForBiquad, biquadResult, 16);
    }

    PRINTF("%s: %d ms\r\n", __func__, TEST_GetTime() - oldTime);

    for (uint32_t i = 0; i < 16; i++)
    {
        EXAMPLE_ASSERT_TRUE(biquadRef[i] == biquadResult[i]);
    }
}

/* The armclang compiler will optimize this API to force the assembly code to be inline,
   resulting in disruption of the execution order of the original code in MDK release mode with -O3.
   Resolution: add noinline attribute to assembly code API to prevent inline optimization by compiler. */
#if (defined(__ARMCC_VERSION))
static void PQ_16ByteBiquadCascadeDf2FX(const pq_biquad_cascade_df2_instance *S,
                                        int32_t *pSrc,
                                        int32_t *pDst,
                                        uint32_t blockSize) __attribute__((noinline))
#else
static void PQ_16ByteBiquadCascadeDf2FX(const pq_biquad_cascade_df2_instance *S,
                                        int32_t *pSrc,
                                        int32_t *pDst,
                                        uint32_t blockSize)
#endif
{
    uint32_t stage            = S->numStages;
    pq_biquad_state_t *states = S->pState;

